In [1]:
import pandas as pd

In [2]:
orders = pd.read_csv('orders.csv')

In [3]:
orders

     order_id customer_id product_id  quantity  order_date
0      O00001       C0333       P022         1  2022-01-09
1      O00002       C0068       P090         1  2022-01-27
2      O00003       C0483       P021         1  2022-01-17
3      O00004       C0214       P076         4  2022-01-07
4      O00005       C0411       P073         4  2022-01-12
...       ...         ...        ...       ...         ...
2579   O02580       C0237       P098         5  2024-12-22
2580   O02581       C0236       P007         1  2024-12-05
2581   O02582       C0029       P035         1  2024-12-12
2582   O02583       C0171       P077         1  2024-12-16
2583   O02584       C0421       P038         5  2024-12-01

[2584 rows x 5 columns]

In [4]:
orders.isnull().sum()

order_id       0
customer_id    0
product_id     0
quantity       0
order_date     0
dtype: int64

In [5]:
orders.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2584 entries, 0 to 2583
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   order_id     2584 non-null   object
 1   customer_id  2584 non-null   object
 2   product_id   2584 non-null   object
 3   quantity     2584 non-null   int64
 4   order_date   2584 non-null   object
dtypes: int64(1), object(4)
memory usage: 101.1+ KB

In [22]:
orders['order_date'] = pd.to_datetime(orders.order_date)

In [23]:
orders

     order_id customer_id product_id  quantity order_date
0      O00001       C0333       P022         1 2022-01-09
1      O00002       C0068       P090         1 2022-01-27
2      O00003       C0483       P021         1 2022-01-17
3      O00004       C0214       P076         4 2022-01-07
4      O00005       C0411       P073         4 2022-01-12
...       ...         ...        ...       ...        ...
2579   O02580       C0237       P098         5 2024-12-22
2580   O02581       C0236       P007         1 2024-12-05
2581   O02582       C0029       P035         1 2024-12-12
2582   O02583       C0171       P077         1 2024-12-16
2583   O02584       C0421       P038         5 2024-12-01

[2584 rows x 5 columns]

In [24]:
orders.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2584 entries, 0 to 2583
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   order_id     2584 non-null   object
 1   customer_id  2584 non-null   object
 2   product_id   2584 non-null   object
 3   quantity     2584 non-null   int64
 4   order_date   2584 non-null   datetime64[ns]
dtypes: datetime64[ns](1), int64(1), object(3)
memory usage: 101.1+ KB

In [28]:
orders['year'] = orders.order_date.dt.year

In [29]:
orders

     order_id customer_id product_id  quantity order_date  year
0      O00001       C0333       P022         1 2022-01-09  2022
1      O00002       C0068       P090         1 2022-01-27  2022
2      O00003       C0483       P021         1 2022-01-17  2022
3      O00004       C0214       P076         4 2022-01-07  2022
4      O00005       C0411       P073         4 2022-01-12  2022
...       ...         ...        ...       ...        ...   ...
2579   O02580       C0237       P098         5 2024-12-22  2024
2580   O02581       C0236       P007         1 2024-12-05  2024
2581   O02582       C0029       P035         1 2024-12-12  2024
2582   O02583       C0171       P077         1 2024-12-16  2024
2583   O02584       C0421       P038         5 2024-12-01  2024

[2584 rows x 6 columns]

In [42]:
orders['months'] = orders.order_date.dt.month

In [43]:
order_group = orders.groupby('year')

In [44]:
orders

     order_id customer_id product_id  quantity order_date  year  months
0      O00001       C0333       P022         1 2022-01-09  2022       1
1      O00002       C0068       P090         1 2022-01-27  2022       1
2      O00003       C0483       P021         1 2022-01-17  2022       1
3      O00004       C0214       P076         4 2022-01-07  2022       1
4      O00005       C0411       P073         4 2022-01-12  2022       1
...       ...         ...        ...       ...        ...   ...     ...
2579   O02580       C0237       P098         5 2024-12-22  2024      12
2580   O02581       C0236       P007         1 2024-12-05  2024      12
2581   O02582       C0029       P035         1 2024-12-12  2024      12
2582   O02583       C0171       P077         1 2024-12-16  2024      12
2583   O02584       C0421       P038         5 2024-12-01  2024      12

[2584 rows x 7 columns]

In [47]:
m_2022_groupe = order_group.get_group(2022).groupby('months')
m_2023_groupe = order_group.get_group(2023).groupby('months')
m_2024_groupe = order_group.get_group(2024).groupby('months')

In [82]:
for year in orders.year.unique():
    year_grp = order_group.get_group(year)
    print(f"Year {year}: Total Quantity Soled: {year_grp.quantity.sum()}")
    counts = year_grp.customer_id.value_counts()
    for index ,value in zip(counts.index,counts.values):
        if value >= 5:
            print(f'{index}: {value}')
    print('*'*10)

Year 2022: Total Quantity Soled: 2549
C0028: 6
C0267: 6
C0080: 6
C0129: 6
C0471: 5
C0047: 5
C0364: 5
C0497: 5
C0237: 5
C0336: 5
C0083: 5
**********
Year 2023: Total Quantity Soled: 2861
C0414: 7
C0243: 6
C0354: 6
C0391: 6
C0256: 6
C0068: 6
C0113: 5
C0358: 5
C0356: 5
C0406: 5
**********
Year 2024: Total Quantity Soled: 2387
C0220: 9
C0310: 6
C0475: 6
C0258: 5
C0461: 5
C0113: 5
C0217: 5
C0075: 5
C0245: 5
C0149: 5
C0418: 5
C0264: 5
C0088: 5
C0181: 5
C0153: 5
C0122: 5
**********

In [83]:
customers = pd.read_csv('customers.csv')

In [84]:
customers

    customer_id       name  age  gender               city
0         C0001   Jennifer   56    Male      Morrisonmouth
1         C0002    William   46    Male  Port Charlesshire
2         C0003      Ellen   32    Male  South Thomasmouth
3         C0004      Sheri   60    Male         West Megan
4         C0005     Taylor   25    Male         Josephland
..          ...        ...  ...     ...                ...
495       C0496  Stephanie   37    Male         Santosport
496       C0497      Susan   41    Male           Annaside
497       C0498    Spencer   29  Female         Harrisside
498       C0499     Rachel   52    Male       Anthonymouth
499       C0500    Jasmine   50    Male         North Mark

[500 rows x 5 columns]

In [89]:
orders_merge = orders.merge(customers, on = 'customer_id', how = 'left')

In [99]:
for year in orders.year.unique():
    year_grp = order_group.get_group(year)
    print(f"Year {year}: Total Quantity Soled: {year_grp.quantity.sum()}")
    counts = year_grp.customer_id.value_counts()
    for index ,value in zip(counts.index,counts.values):
        if value >= 5:
            name = orders_merge[orders_merge['customer_id'] == index]['name'].iloc[0]
            print(f'{index}: {name}: {value}')
    print('*'*10)

Year 2022: Total Quantity Soled: 2549
C0028: Crystal: 6
C0267: Steven: 6
C0080: Deborah: 6
C0129: Christopher: 6
C0471: Wendy: 5
C0047: Anthony: 5
C0364: Sean: 5
C0497: Susan: 5
C0237: Tamara: 5
C0336: Anna: 5
C0083: Amanda: 5
**********
Year 2023: Total Quantity Soled: 2861
C0414: Rachel: 7
C0243: Margaret: 6
C0354: Bryan: 6
C0391: Lindsay: 6
C0256: Ashley: 6
C0068: Kathy: 6
C0113: Ryan: 5
C0358: Catherine: 5
C0356: Nathan: 5
C0406: Kirsten: 5
**********
Year 2024: Total Quantity Soled: 2387
C0220: Joshua: 9
C0310: Sarah: 6
C0475: Brooke: 6
C0258: Paul: 5
C0461: Michele: 5
C0113: Ryan: 5
C0217: Kara: 5
C0075: David: 5
C0245: Andrea: 5
C0149: Matthew: 5
C0418: Stacy: 5
C0264: Tracey: 5
C0088: Kimberly: 5
C0181: Daniel: 5
C0153: Marissa: 5
C0122: David: 5
**********

In [91]:
orders_merge

,order_id,customer_id,product_id,quantity,order_date,year,months,name,age,gender,city
0,O00001,C0333,P022,1,2022-01-09,2022,1,Christopher,34,Female,North Isaactown
1,O00002,C0068,P090,1,2022-01-27,2022,1,Kathy,35,Female,Gambleport
2,O00003,C0483,P021,1,2022-01-17,2022,1,Cody,36,Male,Lake Amandaport
3,O00004,C0214,P076,4,2022-01-07,2022,1,Jennifer,36,Male,Judithstad
4,O00005,C0411,P073,4,2022-01-12,2022,1,Kent,25,Male,East Adamfort
...,...,...,...,...,...,...,...,...,...,...,...
2579,O02580,C0237,P098,5,2024-12-22,2024,12,Tamara,20,Male,West Davidburgh
2580,O02581,C0236,P007,1,2024-12-05,2024,12,Dana,46,Male,Stephenfort
2581,O02582,C0029,P035,1,2024-12-12,2024,12,Denise,42,Female,Darrellshire
2582,O02583,C0171,P077,1,2024-12-16,2024,12,Ashley,61,Female,Thomasbury
2583,O02584,C0421,P038,5,2024-12-01,2024,12,Michael,64,Female,New Abigailton